База для EDT/src/DataProcessors/ФормаРассчета/ФормаРассчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормаРассчета</name>
  <attributes>
    <name>Число1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Число2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

База для EDT/src/DataProcessors/ФормаРассчета/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Рассчитать(Команда)
	
    Объект.Результат = Объект.Число1 * Объект.Число2;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    Объект.Число1 = 2;
	Объект.Число2 = 2;
	
КонецПроцедуры
